In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('census_income.csv')

In [3]:
data.shape

(32560, 15)

In [4]:
data.head()

,Age,Workclass,Fnlwgt,Education,Education_num,Marital_status,Occupation,Relationship,Race,Sex,Capital_gain,Capital_loss,Hours_per_week,Native_country,Income
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [5]:
data.isna().sum()

Age               0
Workclass         0
Fnlwgt            0
Education         0
Education_num     0
Marital_status    0
Occupation        0
Relationship      0
Race              0
Sex               0
Capital_gain      0
Capital_loss      0
Hours_per_week    0
Native_country    0
Income            0
dtype: int64

In [6]:
data.drop_duplicates(inplace=True)

In [7]:
data.shape

(32536, 15)

In [8]:
data['Workclass'].nunique()

9

In [9]:
data['Workclass'].value_counts()

 Private             22673
 Self-emp-not-inc     2540
 Local-gov            2093
 ?                    1836
 State-gov            1297
 Self-emp-inc         1116
 Federal-gov           960
 Without-pay            14
 Never-worked            7
Name: Workclass, dtype: int64

In [10]:
from sklearn.preprocessing import LabelEncoder

In [11]:
le = LabelEncoder()

In [12]:
data['Workclass'] = le.fit_transform(data['Workclass'])

In [13]:
data['Education'].nunique()

16

In [14]:
data['Education'].value_counts()

 HS-grad         10494
 Some-college     7282
 Bachelors        5352
 Masters          1722
 Assoc-voc        1382
 11th             1175
 Assoc-acdm       1067
 10th              933
 7th-8th           645
 Prof-school       576
 9th               514
 12th              433
 Doctorate         413
 5th-6th           332
 1st-4th           166
 Preschool          50
Name: Education, dtype: int64

In [15]:
data['Education'] = le.fit_transform(data['Education'])

In [16]:
data.head()

,Age,Workclass,Fnlwgt,Education,Education_num,Marital_status,Occupation,Relationship,Race,Sex,Capital_gain,Capital_loss,Hours_per_week,Native_country,Income
0,50,6,83311,9,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,4,215646,11,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,4,234721,1,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,4,338409,9,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,4,284582,12,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [17]:
data['Marital_status'].nunique()

7

In [18]:
data['Marital_status'].value_counts()

 Married-civ-spouse       14970
 Never-married            10666
 Divorced                  4441
 Separated                 1025
 Widowed                    993
 Married-spouse-absent      418
 Married-AF-spouse           23
Name: Marital_status, dtype: int64

In [19]:
data['Marital_status'] = le.fit_transform(data['Marital_status'])

In [20]:
data.head()

,Age,Workclass,Fnlwgt,Education,Education_num,Marital_status,Occupation,Relationship,Race,Sex,Capital_gain,Capital_loss,Hours_per_week,Native_country,Income
0,50,6,83311,9,13,2,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,4,215646,11,9,0,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,4,234721,1,7,2,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,4,338409,9,13,2,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,4,284582,12,14,2,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [21]:
data['Occupation'].nunique()

15

In [22]:
data['Occupation'].value_counts()

 Prof-specialty       4136
 Craft-repair         4094
 Exec-managerial      4065
 Adm-clerical         3767
 Sales                3650
 Other-service        3291
 Machine-op-inspct    2000
 ?                    1843
 Transport-moving     1597
 Handlers-cleaners    1369
 Farming-fishing       992
 Tech-support          927
 Protective-serv       649
 Priv-house-serv       147
 Armed-Forces            9
Name: Occupation, dtype: int64

In [23]:
data['Occupation'] = le.fit_transform(data['Occupation'])

In [24]:
data.head()

,Age,Workclass,Fnlwgt,Education,Education_num,Marital_status,Occupation,Relationship,Race,Sex,Capital_gain,Capital_loss,Hours_per_week,Native_country,Income
0,50,6,83311,9,13,2,4,Husband,White,Male,0,0,13,United-States,<=50K
1,38,4,215646,11,9,0,6,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,4,234721,1,7,2,6,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,4,338409,9,13,2,10,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,4,284582,12,14,2,4,Wife,White,Female,0,0,40,United-States,<=50K

In [25]:
data['Relationship'].nunique()

6

In [26]:
data['Relationship'].value_counts()

 Husband           13187
 Not-in-family      8291
 Own-child          5064
 Unmarried          3445
 Wife               1568
 Other-relative      981
Name: Relationship, dtype: int64

In [27]:
data['Relationship'] = le.fit_transform(data['Relationship'])

In [28]:
data.head()

,Age,Workclass,Fnlwgt,Education,Education_num,Marital_status,Occupation,Relationship,Race,Sex,Capital_gain,Capital_loss,Hours_per_week,Native_country,Income
0,50,6,83311,9,13,2,4,0,White,Male,0,0,13,United-States,<=50K
1,38,4,215646,11,9,0,6,1,White,Male,0,0,40,United-States,<=50K
2,53,4,234721,1,7,2,6,0,Black,Male,0,0,40,United-States,<=50K
3,28,4,338409,9,13,2,10,5,Black,Female,0,0,40,Cuba,<=50K
4,37,4,284582,12,14,2,4,5,White,Female,0,0,40,United-States,<=50K

In [29]:
data['Race'].nunique()

5

In [30]:
data['Race'].value_counts()

 White                 27794
 Black                  3122
 Asian-Pac-Islander     1038
 Amer-Indian-Eskimo      311
 Other                   271
Name: Race, dtype: int64

In [31]:
data['Race'] = le.fit_transform(data['Race'])

In [32]:
data.head()

,Age,Workclass,Fnlwgt,Education,Education_num,Marital_status,Occupation,Relationship,Race,Sex,Capital_gain,Capital_loss,Hours_per_week,Native_country,Income
0,50,6,83311,9,13,2,4,0,4,Male,0,0,13,United-States,<=50K
1,38,4,215646,11,9,0,6,1,4,Male,0,0,40,United-States,<=50K
2,53,4,234721,1,7,2,6,0,2,Male,0,0,40,United-States,<=50K
3,28,4,338409,9,13,2,10,5,2,Female,0,0,40,Cuba,<=50K
4,37,4,284582,12,14,2,4,5,4,Female,0,0,40,United-States,<=50K

In [33]:
data['Sex'].nunique()

2

In [34]:
data['Sex'].value_counts()

 Male      21774
 Female    10762
Name: Sex, dtype: int64

In [35]:
data['Sex'] = le.fit_transform(data['Sex'])

In [36]:
data.head()

,Age,Workclass,Fnlwgt,Education,Education_num,Marital_status,Occupation,Relationship,Race,Sex,Capital_gain,Capital_loss,Hours_per_week,Native_country,Income
0,50,6,83311,9,13,2,4,0,4,1,0,0,13,United-States,<=50K
1,38,4,215646,11,9,0,6,1,4,1,0,0,40,United-States,<=50K
2,53,4,234721,1,7,2,6,0,2,1,0,0,40,United-States,<=50K
3,28,4,338409,9,13,2,10,5,2,0,0,0,40,Cuba,<=50K
4,37,4,284582,12,14,2,4,5,4,0,0,0,40,United-States,<=50K

In [37]:
data['Native_country'].nunique()

42

In [38]:
data['Native_country'].value_counts()

 United-States                 29152
 Mexico                          639
 ?                               582
 Philippines                     198
 Germany                         137
 Canada                          121
 Puerto-Rico                     114
 El-Salvador                     106
 India                           100
 Cuba                             95
 England                          90
 Jamaica                          81
 South                            80
 China                            75
 Italy                            73
 Dominican-Republic               70
 Vietnam                          67
 Japan                            62
 Guatemala                        62
 Poland                           60
 Columbia                         59
 Taiwan                           51
 Haiti                            44
 Iran                             43
 Portugal                         37
 Nicaragua                        34
 Peru                             31
 France                           29
 Greece                           29
 Ecuador                          28
 Ireland                          24
 Hong                             20
 Cambodia                         19
 Trinadad&Tobago                  19
 Laos                             18
 Thailand                         18
 Yugoslavia                       16
 Outlying-US(Guam-USVI-etc)       14
 Honduras                         13
 Hungary                          13
 Scotland                         12
 Holand-Netherlands                1
Name: Native_country, dtype: int64

In [39]:
data['Native_country'] = le.fit_transform(data['Native_country'])

In [40]:
data.head()

,Age,Workclass,Fnlwgt,Education,Education_num,Marital_status,Occupation,Relationship,Race,Sex,Capital_gain,Capital_loss,Hours_per_week,Native_country,Income
0,50,6,83311,9,13,2,4,0,4,1,0,0,13,39,<=50K
1,38,4,215646,11,9,0,6,1,4,1,0,0,40,39,<=50K
2,53,4,234721,1,7,2,6,0,2,1,0,0,40,39,<=50K
3,28,4,338409,9,13,2,10,5,2,0,0,0,40,5,<=50K
4,37,4,284582,12,14,2,4,5,4,0,0,0,40,39,<=50K

In [41]:
data['Income'].nunique()

2

In [42]:
data['Income'].value_counts()

 <=50K    24697
 >50K      7839
Name: Income, dtype: int64

In [43]:
data['Income'] = le.fit_transform(data['Income'])

In [44]:
data.head()

,Age,Workclass,Fnlwgt,Education,Education_num,Marital_status,Occupation,Relationship,Race,Sex,Capital_gain,Capital_loss,Hours_per_week,Native_country,Income
0,50,6,83311,9,13,2,4,0,4,1,0,0,13,39,0
1,38,4,215646,11,9,0,6,1,4,1,0,0,40,39,0
2,53,4,234721,1,7,2,6,0,2,1,0,0,40,39,0
3,28,4,338409,9,13,2,10,5,2,0,0,0,40,5,0
4,37,4,284582,12,14,2,4,5,4,0,0,0,40,39,0

In [46]:
cont=['Fnlwgt']

In [47]:
from sklearn.preprocessing import StandardScaler

In [48]:
from scipy.stats import zscore

In [49]:
z = zscore(data[cont])

In [50]:
data = data[(z<3).all(axis=1)]

In [51]:
data.shape

(32190, 15)

In [52]:
x = data.drop('Income',axis=1)

In [53]:
y = data['Income']

In [54]:
from sklearn.model_selection import train_test_split

In [55]:
from sklearn.feature_selection import RFE

In [60]:
selector = RFE(estimator=rf,n_features_to_select=10)

In [62]:
selector = selector.fit(x, y)

In [63]:
print("Optimal number of features: %d" % selector.n_features_)

Optimal number of features: 10

In [64]:
print("Selected features: %s" % selector.support_)

Selected features: [ True  True  True False  True  True  True  True False False  True  True
  True False]

In [65]:
a = x.columns[selector.support_]

In [66]:
a

Index(['Age', 'Workclass', 'Fnlwgt', 'Education_num', 'Marital_status',
       'Occupation', 'Relationship', 'Capital_gain', 'Capital_loss',
       'Hours_per_week'],
      dtype='object')

In [67]:
x = x[a]

In [68]:
x.shape

(32190, 10)

In [69]:
ss = StandardScaler()

In [70]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2,random_state=687)

In [71]:
x_train = ss.fit_transform(x_train)

In [72]:
x_test = ss.transform(x_test)

In [73]:
from sklearn.ensemble import RandomForestClassifier

In [74]:
rf = RandomForestClassifier()

In [75]:
rf.fit(x_train,y_train)

RandomForestClassifier()

In [76]:
pred = rf.predict(x_test)

In [77]:
result = pd.DataFrame({'Actual':y_test,'Predicted':pred})

In [78]:
result

       Actual  Predicted
12437       0          0
8784        0          0
9678        0          0
16613       0          1
3155        1          0
...       ...        ...
18058       0          0
898         0          0
2546        0          0
14754       0          0
12287       1          1

[6438 rows x 2 columns]

In [79]:
from sklearn.metrics import classification_report,confusion_matrix

In [80]:
print(classification_report(y_test,pred))

              precision    recall  f1-score   support

           0       0.88      0.93      0.90      4884
           1       0.72      0.61      0.66      1554

    accuracy                           0.85      6438
   macro avg       0.80      0.77      0.78      6438
weighted avg       0.84      0.85      0.85      6438

In [81]:
from sklearn.metrics import f1_score

In [82]:
f1_score(y_test,pred)

0.6641114982578397